MTNSAWeb/AppLog-20140929.txt

9/29/2014 11:35:56 AM ==> System.Xml.XmlDocument
9/29/2014 11:36:14 AM ==> System.Xml.XmlDocument
9/29/2014 11:37:39 AM ==> 27838548135027011000026127012200000005672701200000144527012000001445120140926110618Addition2014092611061820140927110618chargeMode22MDSPSUBEXPMODE1objectType1isAutoExtend1isFreePeriodfalseoperatorID2701payType1transactionID504021505151409261306181127003orderKey999000000000001430durationOfGracePeriod0serviceAvailability0durationOfSuspendPeriod3servicePayType0fee50cycleEndTime20140927110618Starttime20140926110618channelID3TraceUniqueID504021505151409261306181127006operCodeen_USrentSuccesstruetryfalse
9/29/2014 11:37:59 AM ==> 2030The subscription relationship already exists.chargeMode22MDSPSUBEXPMODE1objectType1isAutoExtend1isFreePeriodfalseoperatorID2701payType1transactionID504021505151409261306181127003orderKey999000000000001430durationOfGracePeriod0serviceAvailability0durationOfSuspendPeriod3servicePayType0fee50cycleEndTime20140927110618Starttime20140926110618channelID3TraceUniqueID504021505151409261306181127006operCodeen_USrentSuccesstruetryfalse
9/29/2014 11:39:23 AM ==> <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><syncOrderRelation xmlns="http://www.csapi.org/schema/parlayx/data/v1_0" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><userID><ID>27838548135</ID><type>0</type></userID><spID>270110000261</spID><productID>2701220000000567</productID><serviceID>27012000001445</serviceID><serviceList>27012000001445</serviceList><updateType>1</updateType><updateTime>20140926110618</updateTime><updateDesc>Addition</updateDesc><effectiveTime>20140926110618</effectiveTime><expiryTime>20140927110618</expiryTime><extensionInfo><item><key>chargeMode</key><value>22</value></item><item><key>MDSPSUBEXPMODE</key><value>1</value></item><item><key>objectType</key><value>1</value></item><item><key>isAutoExtend</key><value>1</value></item><item><key>isFreePeriod</key><value>false</value></item><item><key>operatorID</key><value>2701</value></item><item><key>payType</key><value>1</value></item><item><key>transactionID</key><value>504021505151409261306181127003</value></item><item><key>orderKey</key><value>999000000000001430</value></item><item><key>durationOfGracePeriod</key><value>0</value></item><item><key>serviceAvailability</key><value>0</value></item><item><key>durationOfSuspendPeriod</key><value>3</value></item><item><key>servicePayType</key><value>0</value></item><item><key>fee</key><value>50</value></item><item><key>cycleEndTime</key><value>20140927110618</value></item><item><key>Starttime</key><value>20140926110618</value></item><item><key>channelID</key><value>3</value></item><item><key>TraceUniqueID</key><value>504021505151409261306181127006</value></item><item><key>operCode</key><value>en_US</value></item><item><key>rentSuccess</key><value>true</value></item><item><key>try</key><value>false</value></item></extensionInfo></syncOrderRelation></s:Body></s:Envelope>
9/29/2014 11:39:42 AM ==> <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><syncOrderRelationResponse xmlns="http://www.csapi.org/schema/parlayx/data/v1_0"><syncOrderRelationResult><result>2030</result><resultDescription>The subscription relationship already exists.</resultDescription><extensionInfo><item><key>chargeMode</key><value>22</value></item><item><key>MDSPSUBEXPMODE</key><value>1</value></item><item><key>objectType</key><value>1</value></item><item><key>isAutoExtend</key><value>1</value></item><item><key>isFreePeriod</key><value>false</value></item><item><key>operatorID</key><value>2701</value></item><item><key>payType</key><value>1</value></item><item><key>transactionID</key><value>504021505151409261306181127003</value></item><item><key>orderKey</key><value>999000000000001430</value></item><item><key>durationOfGracePeriod</key><value>0</value></item><item><key>serviceAvailability</key><value>0</value></item><item><key>durationOfSuspendPeriod</key><value>3</value></item><item><key>servicePayType</key><value>0</value></item><item><key>fee</key><value>50</value></item><item><key>cycleEndTime</key><value>20140927110618</value></item><item><key>Starttime</key><value>20140926110618</value></item><item><key>channelID</key><value>3</value></item><item><key>TraceUniqueID</key><value>504021505151409261306181127006</value></item><item><key>operCode</key><value>en_US</value></item><item><key>rentSuccess</key><value>true</value></item><item><key>try</key><value>false</value></item></extensionInfo></syncOrderRelationResult></syncOrderRelationResponse></soap:Body></soap:Envelope>
