String Parsing.xml

<?xml version="1.0" encoding="utf-8" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><ns1:syncOrderRelation xmlns:ns1="http://www.csapi.org/schema/parlayx/data/sync/v1_0/local"><ns1:userID><ID>8801823072595</ID><type>0</type></ns1:userID><ns1:spID>200013</ns1:spID><ns1:productID>0100392939</ns1:productID><ns1:serviceID>0100392971</ns1:serviceID><ns1:serviceList>0100392971</ns1:serviceList><ns1:updateType>1</ns1:updateType><ns1:updateTime>20140918162019</ns1:updateTime><ns1:updateDesc>Addition</ns1:updateDesc><ns1:effectiveTime>20140918102019</ns1:effectiveTime><ns1:expiryTime>20361231180000</ns1:expiryTime><ns1:extensionInfo><item><key>accessCode</key><value>190</value></item><item><key>chargeMode</key><value>0</value></item><item><key>MDSPSUBEXPMODE</key><value>1</value></item><item><key>objectType</key><value>1</value></item><item><key>shortCode</key><value>190</value></item><item><key>isFreePeriod</key><value>false</value></item><item><key>payType</key><value>1</value></item><item><key>transactionID</key><value>1410943571294</value></item><item><key>orderKey</key><value>999000000000001927</value></item><item><key>keyword</key><value>on</value></item><item><key>durationOfGracePeriod</key><value>-1</value></item><item><key>serviceAvailability</key><value>0</value></item><item><key>servicePayType</key><value>0</value></item><item><key>fee</key><value>200</value></item><item><key>cycleEndTime</key><value>20141017180000</value></item><item><key>Starttime</key><value>20140917180000</value></item><item><key>channelID</key><value>2</value></item><item><key>TraceUniqueID</key><value>504021503201409181620192017005</value></item><item><key>messageID</key><value>261</value></item><item><key>rentSuccess</key><value>true</value></item><item><key>try</key><value>false</value></item></ns1:extensionInfo></ns1:syncOrderRelation></soapenv:Body></soapenv:Envelope>